In [ ]:
import psycopg2

conn = psycopg2.connect(
    host="localhost",
    database="final_project",
    user="postgres",
    password="PASSWORD01#"
)
curr = conn.cursor()

In [8]:
curr.execute('''
             CREATE TABLE IF NOT EXISTS fact_funds(
             date_id INT NOT NULL,
             fund_key INT NOT NULL,
             nav NUMERIC(10,3)
             )
             '''
             )

conn.commit()

In [12]:
import pandas as pd

curr.execute('''
             SELECT * FROM fund_data
             ''')

fund_data = curr.fetchall()

df_fund = pd.DataFrame(fund_data, columns=['fund_id', 'date', 'nav'])

In [13]:
df_fund

        fund_id        date      nav
0        100033  2025-08-14  884.070
1        100033  2025-08-13  882.600
2        100033  2025-08-12  875.810
3        100033  2025-08-11  877.640
4        100033  2025-08-08  874.310
...         ...         ...      ...
188898   153627  2025-08-05   10.008
188899   153627  2025-08-04   10.042
188900   153627  2025-08-01    9.991
188901   153627  2025-07-31   10.046
188902   153627  2025-07-30   10.054

[188903 rows x 3 columns]

In [18]:
import pandas as pd

curr.execute('''
             SELECT date_id, date FROM dim_date
             ''')

date_data = curr.fetchall()

dim_date = pd.DataFrame(date_data, columns=['date_id', 'date'])

curr.execute('''
             SELECT fund_key, fund_id FROM dim_fund
             ''')

fund_data = curr.fetchall()

dim_fund = pd.DataFrame(fund_data, columns=['fund_key', 'fund_id'])

In [20]:
dim_date, dim_fund

(      date_id        date
 0           1  2010-01-01
 1           2  2010-01-02
 2           3  2010-01-03
 3           4  2010-01-04
 4           5  2010-01-05
 ...       ...         ...
 9491     9492  2035-12-27
 9492     9493  2035-12-28
 9493     9494  2035-12-29
 9494     9495  2035-12-30
 9495     9496  2035-12-31

 [9496 rows x 2 columns],
     fund_key  fund_id
 0          1   100033
 1          2   100177
 2          3   100219
 3          4   100475
 4          5   100477
 ..       ...      ...
 91        92   153238
 92        93   153327
 93        94   153533
 94        95   153627
 95        96   132983

 [96 rows x 2 columns])

In [21]:
fact_fund = df_fund.merge(dim_date, on='date', how='left')

In [22]:
fact_fund

        fund_id        date      nav  date_id
0        100033  2025-08-14  884.070   5705.0
1        100033  2025-08-13  882.600   5704.0
2        100033  2025-08-12  875.810   5703.0
3        100033  2025-08-11  877.640   5702.0
4        100033  2025-08-08  874.310   5699.0
...         ...         ...      ...      ...
188898   153627  2025-08-05   10.008   5696.0
188899   153627  2025-08-04   10.042   5695.0
188900   153627  2025-08-01    9.991   5692.0
188901   153627  2025-07-31   10.046   5691.0
188902   153627  2025-07-30   10.054   5690.0

[188903 rows x 4 columns]

In [26]:
fact_fund = fact_fund.merge(dim_fund, on='fund_id', how='left')

fact_fund

        fund_id        date      nav  date_id  fund_key
0        100033  2025-08-14  884.070   5705.0         1
1        100033  2025-08-13  882.600   5704.0         1
2        100033  2025-08-12  875.810   5703.0         1
3        100033  2025-08-11  877.640   5702.0         1
4        100033  2025-08-08  874.310   5699.0         1
...         ...         ...      ...      ...       ...
188898   153627  2025-08-05   10.008   5696.0        95
188899   153627  2025-08-04   10.042   5695.0        95
188900   153627  2025-08-01    9.991   5692.0        95
188901   153627  2025-07-31   10.046   5691.0        95
188902   153627  2025-07-30   10.054   5690.0        95

[188903 rows x 5 columns]

In [28]:
fact_fund.drop(columns=['date', 'fund_id'], inplace=True)
fact_fund

            nav  date_id  fund_key
0       884.070   5705.0         1
1       882.600   5704.0         1
2       875.810   5703.0         1
3       877.640   5702.0         1
4       874.310   5699.0         1
...         ...      ...       ...
188898   10.008   5696.0        95
188899   10.042   5695.0        95
188900    9.991   5692.0        95
188901   10.046   5691.0        95
188902   10.054   5690.0        95

[188903 rows x 3 columns]

In [ ]:
from sqlalchemy import create_engine

engine = create_engine('postgresql+psycopg2://postgres:PASSWORD01#@localhost/final_project')

fact_fund.to_sql('fact_fund', engine, if_exists='replace', index=False)

903

In [31]:
curr.close()

In [41]:
# Fact_fund_holdings

curr = conn.cursor()

curr.execute('''
             SELECT * FROM fund_holdings
             '''
)

fund_holdings = curr.fetchall()

fact_fund_holdings = pd.DataFrame(fund_holdings, columns=['stock_name', 'isin', 'industry',
                                                          'quantity', 'market_value_in_lacs', 'scheme_code', 'scheme_name'])

In [42]:
fact_fund_holdings.drop(columns=['isin', 'scheme_name'], inplace=True)

fact_fund_holdings = fact_fund_holdings.merge(dim_fund, left_on='scheme_code', right_on='fund_id', how='left')

In [43]:
fact_fund_holdings

,stock_name,industry,quantity,market_value_in_lacs,scheme_code,fund_key,fund_id
0,Shakti Pumps (India) Ltd.,Industrial Products,143945.00,1359.78,152001,82,152001
1,UNO Minda Ltd.,Auto Components,105773.00,1168.05,152001,82,152001
2,The Federal Bank Ltd.,Banks,499962.00,1065.52,152001,82,152001
3,Trent Ltd.,Retailing,16206.00,1007.61,152001,82,152001
4,Bharat Electronics Ltd.,Aerospace & Defense,189881.00,800.35,152001,82,152001
...,...,...,...,...,...,...,...
786,NETWEB TECHNOLOGIES INDIA LTD,IT - Services,266002.00,4908.27,145208,58,145208
787,BLUSPRING ENTERPRISES LTD.,Commercial Services & Supplies,4804600.00,3648.61,145208,58,145208
788,BALRAMPUR CHINI MILLS LTD.,Agricultural Food & other Products,502135.00,2981.93,145208,58,145208
789,AUTOMOTIVE AXLES LTD.,Auto Components,143392.00,2567.00,145208,58,145208
790,TRANSINDIA REAL ESTATE LIMITED,Transport Services,3095712.00,1103.62,145208,58,145208

In [44]:
fact_fund_holdings.drop(columns=['scheme_code', 'fund_id'], inplace=True)

In [45]:
fact_fund_holdings

,stock_name,industry,quantity,market_value_in_lacs,fund_key
0,Shakti Pumps (India) Ltd.,Industrial Products,143945.00,1359.78,82
1,UNO Minda Ltd.,Auto Components,105773.00,1168.05,82
2,The Federal Bank Ltd.,Banks,499962.00,1065.52,82
3,Trent Ltd.,Retailing,16206.00,1007.61,82
4,Bharat Electronics Ltd.,Aerospace & Defense,189881.00,800.35,82
...,...,...,...,...,...
786,NETWEB TECHNOLOGIES INDIA LTD,IT - Services,266002.00,4908.27,58
787,BLUSPRING ENTERPRISES LTD.,Commercial Services & Supplies,4804600.00,3648.61,58
788,BALRAMPUR CHINI MILLS LTD.,Agricultural Food & other Products,502135.00,2981.93,58
789,AUTOMOTIVE AXLES LTD.,Auto Components,143392.00,2567.00,58
790,TRANSINDIA REAL ESTATE LIMITED,Transport Services,3095712.00,1103.62,58

In [46]:
curr.execute('''
             CREATE TABLE IF NOT EXISTS fact_fund_holdings(
             fund_key INT NOT NULL,
             stock_name VARCHAR(200) NOT NULL,
             industry VARCHAR(200),
             quantity NUMERIC(15,2) NOT NULL,
             market_value_in_lacs NUMERIC(15,2) NOT NULL
             )
             '''
             )

conn.commit()

In [ ]:
from sqlalchemy import create_engine

engine = create_engine('postgresql+psycopg2://postgres:PASSWORD01#@localhost/final_project')

fact_fund_holdings.to_sql('fact_fund_holdings', engine, if_exists='replace', index=False)

791

In [48]:
curr.close()

In [ ]:
# fact_ticker

In [49]:
curr = conn.cursor()

curr.execute('''
             SELECT * FROM ticker_data
             ''')

ticker_data = curr.fetchall()

fact_ticker = pd.DataFrame(ticker_data, columns=['date', 'ticker', 'open', 'high', 'low', 'close', 'volume'])

In [ ]:
fact_ticker

,date,ticker,open,high,low,close,volume
0,2015-01-01,ICICIBANK.NS,294.358,294.984,292.271,294.024,2583280.00
1,2015-01-01,TCS.NS,1082.556,1082.556,1071.592,1073.510,366830.00
2,2015-01-01,RELIANCE.NS,189.657,190.877,189.090,190.000,2963643.00
3,2015-01-01,HDFCBANK.NS,436.040,437.599,433.312,436.521,1772470.00
4,2015-01-01,CYIENT.NS,403.997,407.919,400.074,401.996,14488.00
...,...,...,...,...,...,...,...
41158,2025-07-31,^NSEMDCP50,16170.300,16315.250,16101.950,16212.450,6100.00
41159,2025-07-31,TATAELXSI.NS,6084.000,6138.500,6001.000,6093.500,138299.00
41160,2025-07-31,EQUITASBNK.NS,60.000,60.100,58.900,59.260,1827719.00
41161,2025-07-31,^NSEI,24642.250,24956.500,24635.000,24768.350,346300.00
41162,2025-07-31,ZYDUSLIFE.NS,975.050,986.450,961.100,969.800,1187065.00

In [57]:
dim_date

      date_id        date
0           1  2010-01-01
1           2  2010-01-02
2           3  2010-01-03
3           4  2010-01-04
4           5  2010-01-05
...       ...         ...
9491     9492  2035-12-27
9492     9493  2035-12-28
9493     9494  2035-12-29
9494     9495  2035-12-30
9495     9496  2035-12-31

[9496 rows x 2 columns]

In [77]:
dim_date

      date_id        date
0           1  2010-01-01
1           2  2010-01-02
2           3  2010-01-03
3           4  2010-01-04
4           5  2010-01-05
...       ...         ...
9491     9492  2035-12-27
9492     9493  2035-12-28
9493     9494  2035-12-29
9494     9495  2035-12-30
9495     9496  2035-12-31

[9496 rows x 2 columns]

In [78]:
fact_ticker = fact_ticker.merge(dim_date, left_on='date', right_on='date', how='left')

fact_ticker

,date,ticker,open,high,low,close,volume,date_id
0,2015-01-01,ICICIBANK.NS,294.358,294.984,292.271,294.024,2583280.00,1827
1,2015-01-01,TCS.NS,1082.556,1082.556,1071.592,1073.510,366830.00,1827
2,2015-01-01,RELIANCE.NS,189.657,190.877,189.090,190.000,2963643.00,1827
3,2015-01-01,HDFCBANK.NS,436.040,437.599,433.312,436.521,1772470.00,1827
4,2015-01-01,CYIENT.NS,403.997,407.919,400.074,401.996,14488.00,1827
...,...,...,...,...,...,...,...,...
41158,2025-07-31,^NSEMDCP50,16170.300,16315.250,16101.950,16212.450,6100.00,5691
41159,2025-07-31,TATAELXSI.NS,6084.000,6138.500,6001.000,6093.500,138299.00,5691
41160,2025-07-31,EQUITASBNK.NS,60.000,60.100,58.900,59.260,1827719.00,5691
41161,2025-07-31,^NSEI,24642.250,24956.500,24635.000,24768.350,346300.00,5691
41162,2025-07-31,ZYDUSLIFE.NS,975.050,986.450,961.100,969.800,1187065.00,5691

In [79]:
curr.execute('''
             SELECT ticker_id, ticker FROM dim_ticker
             ''')

ticker_info = curr.fetchall()

dim_ticker = pd.DataFrame(ticker_info, columns=['ticker_id', 'ticker'])

In [80]:
dim_ticker

    ticker_id         ticker
0           1      AUBANK.NS
1           2  BHARATFORG.NS
2           3        CDSL.NS
3           4      CYIENT.NS
4           5  EQUITASBNK.NS
5           6    HDFCBANK.NS
6           7   ICICIBANK.NS
7           8        INFY.NS
8           9    KPITTECH.NS
9          10   MAXHEALTH.NS
10         11    RELIANCE.NS
11         12   TATAELXSI.NS
12         13         TCS.NS
13         14     TIINDIA.NS
14         15   ZYDUSLIFE.NS
15         16         ^BSESN
16         17         ^CNXSC
17         18          ^NSEI
18         19     ^NSEMDCP50

In [81]:
fact_ticker = fact_ticker.merge(dim_ticker, on='ticker', how='left')

fact_ticker

,date,ticker,open,high,low,close,volume,date_id,ticker_id
0,2015-01-01,ICICIBANK.NS,294.358,294.984,292.271,294.024,2583280.00,1827,7
1,2015-01-01,TCS.NS,1082.556,1082.556,1071.592,1073.510,366830.00,1827,13
2,2015-01-01,RELIANCE.NS,189.657,190.877,189.090,190.000,2963643.00,1827,11
3,2015-01-01,HDFCBANK.NS,436.040,437.599,433.312,436.521,1772470.00,1827,6
4,2015-01-01,CYIENT.NS,403.997,407.919,400.074,401.996,14488.00,1827,4
...,...,...,...,...,...,...,...,...,...
41158,2025-07-31,^NSEMDCP50,16170.300,16315.250,16101.950,16212.450,6100.00,5691,19
41159,2025-07-31,TATAELXSI.NS,6084.000,6138.500,6001.000,6093.500,138299.00,5691,12
41160,2025-07-31,EQUITASBNK.NS,60.000,60.100,58.900,59.260,1827719.00,5691,5
41161,2025-07-31,^NSEI,24642.250,24956.500,24635.000,24768.350,346300.00,5691,18
41162,2025-07-31,ZYDUSLIFE.NS,975.050,986.450,961.100,969.800,1187065.00,5691,15

In [82]:
fact_ticker.drop(columns=['ticker', 'date', 'open', 'high', 'low', 'volume'], inplace=True)

In [83]:
fact_ticker.rename(columns={
    'ticker_id':'ticker_id',
    'date_id':'date_id',
    'close':'value'
}, inplace=True)

In [84]:
fact_ticker

           value  date_id  ticker_id
0        294.024     1827          7
1       1073.510     1827         13
2        190.000     1827         11
3        436.521     1827          6
4        401.996     1827          4
...          ...      ...        ...
41158  16212.450     5691         19
41159   6093.500     5691         12
41160     59.260     5691          5
41161  24768.350     5691         18
41162    969.800     5691         15

[41163 rows x 3 columns]

In [85]:
curr.execute('''
             CREATE TABLE IF NOT EXISTS fund_tickers(
             ticker_id INTEGER NOT NULL,
             date_id INTEGER NOT  NULL,
             value NUMERIC(10,3) NOT NULL
             )
             '''
)

conn.commit()

In [ ]:
from sqlalchemy import create_engine

engine = create_engine('postgresql+psycopg2://postgres:PASSWORD01#@localhost/final_project')

fact_ticker.to_sql('fact_tickers', engine, if_exists='replace', index=False)

163